      *--------------------------------------------------+-------------*
      * Desc: Get input from user                        ! Cr: 05082022*
      *--------------------------------------------------+-------------*
      * Type: Module Input (mi)                          ! Up: 05082022*
      *-----------------+--------------------------------+-------------*
      * Incl: KVTEST3A  !                                ! Ver: 01     *
      *-----------------+--------------------------------+-------------*
           05 PGMID pic x(8).
           05 PGM_KEY pic x(60).
